13/data/attachments/b62a80aa658afa63.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_46c8375b-b8f7-47cb-b7a4-5c6e1163b72f</nif:username>
            <nif:friendToBeAdded>Mary_soldier_Friend_43391_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>